/// Метасимволы `+` и `*` обеспечивают совпадение с не­ ограниченным количеством символов.
/// Они не позво ляют никоим образом задать максимальное количес­тво совпадающих символов.
///
/// Метасимволы `+`, `*` и `?` поддерживают лишь мини­мальные количества совпадающих символов:
/// нулевое и единичное. Они не позволяют никоим образом за­дать вручную минимальное
/// количество совпадений.
///
/// Кроме того, нельзя никоим образом задать требую­щееся количество совпадений.

// ignore: no-empty-block
void main() {}
